"""
Напишите функцию, которая принимает массив чисел и возвращает сумму чисел.
Числа могут быть отрицательными или нецелочисленными.
Если массив не содержит никаких чисел, то вы должны вернуть 0.

"""

a = []

def sum_array(a) -> int:
    return sum(a)

if __name__ == "__main__":
    print(sum_array(a))
